#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.aws_iam_role.deployment: Reading...
aws_vpc.main: Refreshing state... [id=vpc-0c352107e629e3334]
aws_dynamodb_table.terraform_state_lock: Refreshing state... [id=terraform-state]
aws_s3_bucket.terraform_state: Refreshing state... [id=mati-terraform-state]
aws_vpc.main2: Refreshing state... [id=vpc-05b195770f8e88c31]
data.aws_iam_role.deployment: Read complete after 0s [id=deployment-role]
aws_s3_bucket_policy.terraform_state: Refreshing state... [id=mati-terraform-state]
aws_s3_bucket_versioning.terraform_state: Refreshing state... [id=mati-terraform-state]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_organizations_organization.org will be created
  + resource "aws_organizations_organization" "org" {
      + accounts             = (known after apply)
      + arn                  = (known after apply)
      + feature_set          = "ALL"
      + id                   = (known after apply)
      + master_account_arn   = (known after apply)
      + master_account_email = (known after apply)
      + master_account_id    = (known after apply)
      + master_account_name  = (known after apply)
      + non_master_accounts  = (known after apply)
      + roots                = (known after apply)
    }

  # aws_organizations_organizational_unit.preprod will be created
  + resource "aws_organizations_organizational_unit" "preprod" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "preprod"
      + parent_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_organizations_organizational_unit.prod will be created
  + resource "aws_organizations_organizational_unit" "prod" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "production"
      + parent_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_vpc.main2 will be destroyed
  # (because aws_vpc.main2 is not in configuration)
  - resource "aws_vpc" "main2" {
      - arn                                  = "arn:aws:ec2:eu-west-2:980921709551:vpc/vpc-05b195770f8e88c31" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "11.0.0.0/16" -> null
      - default_network_acl_id               = "acl-0bf2a6524393172d7" -> null
      - default_route_table_id               = "rtb-0cb5ddb226ac19760" -> null
      - default_security_group_id            = "sg-0a7651c61a980e6dd" -> null
      - dhcp_options_id                      = "dopt-0e93ca30e58faff79" -> null
      - enable_dns_hostnames                 = false -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-05b195770f8e88c31" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-0cb5ddb226ac19760" -> null
      - owner_id                             = "980921709551" -> null
      - tags_all                             = {} -> null
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @alexmxti, Working Directory: `aws-account-management`*